avrdudes/avr-libc/include/avr/ioavr32la20.h
/* SDA Setup Time select bit group values */
typedef enum TWI_SDASETUP_VALUES_enum
{
    TWI_SDASETUP_4CYC_gv           = 0x00,  /* SDA setup time is four clock cycles */
    TWI_SDASETUP_8CYC_gv           = 0x01   /* SDA setup time is eight clock cycle */
} TWI_SDASETUP_values_t;

/* SDA Setup Time select bit group configurations*/
typedef enum TWI_SDASETUP_enum
{
    TWI_SDASETUP_4CYC_gc           = (TWI_SDASETUP_4CYC_gv << TWI_SDASETUP_bp),  /* SDA setup time is four clock cycles */
    TWI_SDASETUP_8CYC_gc           = (TWI_SDASETUP_8CYC_gv << TWI_SDASETUP_bp)   /* SDA setup time is eight clock cycle */
} TWI_SDASETUP_t;

/* Inactive Bus Time-Out select bit group values */
typedef enum TWI_TIMEOUT_VALUES_enum
{
    TWI_TIMEOUT_DISABLED_gv        = 0x00,  /* Bus time-out disabled. I2C. */
    TWI_TIMEOUT_50US_gv            = 0x01,  /* 50us - SMBus */
    TWI_TIMEOUT_100US_gv           = 0x02,  /* 100us */
    TWI_TIMEOUT_200US_gv           = 0x03   /* 200us */
} TWI_TIMEOUT_values_t;

/* Inactive Bus Time-Out select bit group configurations*/
typedef enum TWI_TIMEOUT_enum
{
    TWI_TIMEOUT_DISABLED_gc        = (TWI_TIMEOUT_DISABLED_gv << TWI_TIMEOUT_gp),  /* Bus time-out disabled. I2C. */
    TWI_TIMEOUT_50US_gc            = (TWI_TIMEOUT_50US_gv << TWI_TIMEOUT_gp),  /* 50us - SMBus */
    TWI_TIMEOUT_100US_gc           = (TWI_TIMEOUT_100US_gv << TWI_TIMEOUT_gp),  /* 100us */
    TWI_TIMEOUT_200US_gc           = (TWI_TIMEOUT_200US_gv << TWI_TIMEOUT_gp)   /* 200us */
} TWI_TIMEOUT_t;

/*
--------------------------------------------------------------------------
USART - Universal Synchronous and Asynchronous Receiver and Transmitter
--------------------------------------------------------------------------
*/

/* Universal Synchronous and Asynchronous Receiver and Transmitter */
typedef struct USART_struct
{
    register8_t CTRLA;  /* Control A */
    register8_t CTRLB;  /* Control B */
    register8_t CTRLC;  /* Control C */
    register8_t CTRLD;  /* Control D */
    register8_t CTRLE;  /* Control E */
    register8_t CTRLF;  /* Control F */
    register8_t CTRLG;  /* Control G */
    register8_t COMMAND;  /* Command */
    register8_t reserved_1[1];
    register8_t EVCTRL;  /* Event Control */
    _WORDREGISTER(BAUD);  /* Baud Rate */
    register8_t INTCTRL;  /* Interrupt Control */
    register8_t INTFLAGS;  /* Interrupt Flags */
    register8_t STATUS;  /* Status */
    register8_t reserved_2[1];
    register8_t RXDATAL;  /* Receive Data Low Byte */
    register8_t RXDATAH;  /* Receive Data */
    register8_t TXDATAL;  /* Transmit Data Low Byte */
    register8_t TXDATAH;  /* Transmit Data High Byte */
    register8_t reserved_3[4];
    register8_t AUXDATA0;  /* Auxiliary Data 0 */
    register8_t AUXDATA1;  /* Auxiliary Data 1 */
    register8_t AUXDATA2;  /* Auxiliary Data 2 */
    register8_t reserved_4[4];
    register8_t DBGCTRL;  /* Debug Control */
} USART_t;

/* Auto Baud Window select bit group values */
typedef enum USART_ABW_VALUES_enum
{
    USART_ABW_WDW0_gv              = 0x00,  /* 18% tolerance */
    USART_ABW_WDW1_gv              = 0x01,  /* 15% tolerance */
    USART_ABW_WDW2_gv              = 0x02,  /* 21% tolerance */
    USART_ABW_WDW3_gv              = 0x03   /* 25% tolerance */
} USART_ABW_values_t;

/* Auto Baud Window select bit group configurations*/
typedef enum USART_ABW_enum
{
    USART_ABW_WDW0_gc              = (USART_ABW_WDW0_gv << USART_ABW_gp),  /* 18% tolerance */
    USART_ABW_WDW1_gc              = (USART_ABW_WDW1_gv << USART_ABW_gp),  /* 15% tolerance */
    USART_ABW_WDW2_gc              = (USART_ABW_WDW2_gv << USART_ABW_gp),  /* 21% tolerance */
    USART_ABW_WDW3_gc              = (USART_ABW_WDW3_gv << USART_ABW_gp)   /* 25% tolerance */
} USART_ABW_t;

/* Break Length select bit group values */
typedef enum USART_BRKLEN_VALUES_enum
{
    USART_BRKLEN_13BIT_gv          = 0x00,  /* Break field transmission is 13 bit time */
    USART_BRKLEN_17BIT_gv          = 0x01,  /* Break field transmission is 17 bit time */
    USART_BRKLEN_21BIT_gv          = 0x02,  /* Break field transmission is 21 bit time */
    USART_BRKLEN_26BIT_gv          = 0x03   /* Break field transmission is 26 bit time */
} USART_BRKLEN_values_t;

/* Break Length select bit group configurations*/
typedef enum USART_BRKLEN_enum
{
    USART_BRKLEN_13BIT_gc          = (USART_BRKLEN_13BIT_gv << USART_BRKLEN_gp),  /* Break field transmission is 13 bit time */
    USART_BRKLEN_17BIT_gc          = (USART_BRKLEN_17BIT_gv << USART_BRKLEN_gp),  /* Break field transmission is 17 bit time */
    USART_BRKLEN_21BIT_gc          = (USART_BRKLEN_21BIT_gv << USART_BRKLEN_gp),  /* Break field transmission is 21 bit time */
    USART_BRKLEN_26BIT_gc          = (USART_BRKLEN_26BIT_gv << USART_BRKLEN_gp)   /* Break field transmission is 26 bit time */
} USART_BRKLEN_t;

/* Character Size select bit group values */
typedef enum USART_CHSIZE_VALUES_enum
{
    USART_CHSIZE_5BIT_gv           = 0x00,  /* Character size: 5 bit */
    USART_CHSIZE_6BIT_gv           = 0x01,  /* Character size: 6 bit */
    USART_CHSIZE_7BIT_gv           = 0x02,  /* Character size: 7 bit */
    USART_CHSIZE_8BIT_gv           = 0x03,  /* Character size: 8 bit */
    USART_CHSIZE_9BITL_gv          = 0x06,  /* Character size: 9 bit read low byte first */
    USART_CHSIZE_9BITH_gv          = 0x07   /* Character size: 9 bit read high byte first */
} USART_CHSIZE_values_t;

/* Character Size select bit group configurations*/
typedef enum USART_CHSIZE_enum
{
    USART_CHSIZE_5BIT_gc           = (USART_CHSIZE_5BIT_gv << USART_CHSIZE_gp),  /* Character size: 5 bit */
    USART_CHSIZE_6BIT_gc           = (USART_CHSIZE_6BIT_gv << USART_CHSIZE_gp),  /* Character size: 6 bit */
    USART_CHSIZE_7BIT_gc           = (USART_CHSIZE_7BIT_gv << USART_CHSIZE_gp),  /* Character size: 7 bit */
    USART_CHSIZE_8BIT_gc           = (USART_CHSIZE_8BIT_gv << USART_CHSIZE_gp),  /* Character size: 8 bit */
    USART_CHSIZE_9BITL_gc          = (USART_CHSIZE_9BITL_gv << USART_CHSIZE_gp),  /* Character size: 9 bit read low byte first */
    USART_CHSIZE_9BITH_gc          = (USART_CHSIZE_9BITH_gv << USART_CHSIZE_gp)   /* Character size: 9 bit read high byte first */
} USART_CHSIZE_t;

/* Communication Mode select bit group values */
typedef enum USART_CMODE_VALUES_enum
{
    USART_CMODE_ASYNCHRONOUS_gv    = 0x00,  /* Asynchronous Mode */
    USART_CMODE_SYNCCLIENT_gv      = 0x01,  /* Synchronous USART, client mode */
    USART_CMODE_SYNCHOST_gv        = 0x02,  /* Synchronous USART, host mode */
    USART_CMODE_SPIHOST_gv         = 0x03   /* SPI Host Mode */
} USART_CMODE_values_t;

/* Communication Mode select bit group configurations*/
typedef enum USART_CMODE_enum
{
    USART_CMODE_ASYNCHRONOUS_gc    = (USART_CMODE_ASYNCHRONOUS_gv << USART_CMODE_gp),  /* Asynchronous Mode */
    USART_CMODE_SYNCCLIENT_gc      = (USART_CMODE_SYNCCLIENT_gv << USART_CMODE_gp),  /* Synchronous USART, client mode */
    USART_CMODE_SYNCHOST_gc        = (USART_CMODE_SYNCHOST_gv << USART_CMODE_gp),  /* Synchronous USART, host mode */
    USART_CMODE_SPIHOST_gc         = (USART_CMODE_SPIHOST_gv << USART_CMODE_gp)   /* SPI Host Mode */
} USART_CMODE_t;

/* Clock Phase select bit group values */
typedef enum USART_CPHA_VALUES_enum
{
    USART_CPHA_LEADEDGE_gv         = 0x00,  /* Data is sampled on leading/first edge of SCK */
    USART_CPHA_TRAILEDGE_gv        = 0x01   /* Data is sampled on trailing/last edge of SCK */
} USART_CPHA_values_t;

/* Clock Phase select bit group configurations*/
typedef enum USART_CPHA_enum
{
    USART_CPHA_LEADEDGE_gc         = (USART_CPHA_LEADEDGE_gv << USART_CPHA_bp),  /* Data is sampled on leading/first edge of SCK */
    USART_CPHA_TRAILEDGE_gc        = (USART_CPHA_TRAILEDGE_gv << USART_CPHA_bp)   /* Data is sampled on trailing/last edge of SCK */
} USART_CPHA_t;

